RSX-Engineering/arduino-ultraproffie/boards.txt
UltraProffieLite-L431CC.menu.boardVersion.HWVER3=PL21L
UltraProffieLite-L431CC.menu.boardVersion.HWVER3.bv.selection=L21L
UltraProffieLite-L431CC.menu.boardVersion.HWVER3.bv.audio=2
UltraProffieLite-L431CC.menu.boardVersion.HWVER3.bv.charger=1
UltraProffieLite-L431CC.menu.boardVersion.HWVER3.bv.sns=L
UltraProffieLite-L431CC.menu.boardVersion.HWVER3.bv.pwmch=4
UltraProffieLite-L431CC.menu.boardVersion.HWVER3.bv.booster=0

UltraProffieLite-L431CC.menu.boardVersion.HWVER4=PL20L
UltraProffieLite-L431CC.menu.boardVersion.HWVER4.bv.selection=L20L
UltraProffieLite-L431CC.menu.boardVersion.HWVER4.bv.audio=2
UltraProffieLite-L431CC.menu.boardVersion.HWVER4.bv.charger=0
UltraProffieLite-L431CC.menu.boardVersion.HWVER4.bv.sns=L
UltraProffieLite-L431CC.menu.boardVersion.HWVER4.bv.pwmch=4
UltraProffieLite-L431CC.menu.boardVersion.HWVER4.bv.booster=0

UltraProffieLite-L431CC.menu.operatingSys.pfosx=ProffieOSX
UltraProffieLite-L431CC.menu.operatingSys.pfosx.os.selection=OSx
UltraProffieLite-L431CC.menu.operatingSys.pfos=ProffieOS
UltraProffieLite-L431CC.menu.operatingSys.pfos.os.selection=OSx_None

UltraProffieLite-L431CC.menu.prop.prop1=UltraSaber
UltraProffieLite-L431CC.menu.prop.prop1.pp.selection=PF_PROP_ULTRASABERS
UltraProffieLite-L431CC.menu.prop.prop2=Saber
UltraProffieLite-L431CC.menu.prop.prop2.pp.selection=PF_PROP_SABER
UltraProffieLite-L431CC.menu.prop.prop3=Saber SHTOK
UltraProffieLite-L431CC.menu.prop.prop3.pp.selection=PF_PROP_SABER_SHTOK
UltraProffieLite-L431CC.menu.prop.prop4=Saber SA22C
UltraProffieLite-L431CC.menu.prop.prop4.pp.selection=PF_PROP_SABER_SA22C
UltraProffieLite-L431CC.menu.prop.prop5=Saber FETT
UltraProffieLite-L431CC.menu.prop.prop5.pp.selection=PF_PROP_SABER_FETT
UltraProffieLite-L431CC.menu.prop.prop6=Saber BC
UltraProffieLite-L431CC.menu.prop.prop6.pp.selection=PF_PROP_SABER_BC
UltraProffieLite-L431CC.menu.prop.prop7=Detonator
UltraProffieLite-L431CC.menu.prop.prop7.pp.selection=PF_PROP_DETON
UltraProffieLite-L431CC.menu.prop.prop8=Blaster
UltraProffieLite-L431CC.menu.prop.prop8.pp.selection=PF_PROP_BLASTER
UltraProffieLite-L431CC.menu.prop.prop9=AudioFx
UltraProffieLite-L431CC.menu.prop.prop9.pp.selection=PF_PROP_AUDIOFX

UltraProffieLite-L431CC.menu.SupportedBlades.sbdefTwo=2 (default)
UltraProffieLite-L431CC.menu.SupportedBlades.sbdefTwo.sb.selection=2
UltraProffieLite-L431CC.menu.SupportedBlades.sbOne=1
UltraProffieLite-L431CC.menu.SupportedBlades.sbOne.sb.selection=1
UltraProffieLite-L431CC.menu.SupportedBlades.sbTwo=2
UltraProffieLite-L431CC.menu.SupportedBlades.sbTwo.sb.selection=2
UltraProffieLite-L431CC.menu.SupportedBlades.sbThree=3
UltraProffieLite-L431CC.menu.SupportedBlades.sbThree.sb.selection=3
UltraProffieLite-L431CC.menu.SupportedBlades.sbFour=4
UltraProffieLite-L431CC.menu.SupportedBlades.sbFour.sb.selection=4
UltraProffieLite-L431CC.menu.SupportedBlades.sbFive=5
UltraProffieLite-L431CC.menu.SupportedBlades.sbFive.sb.selection=5
UltraProffieLite-L431CC.menu.SupportedBlades.sbSix=6
UltraProffieLite-L431CC.menu.SupportedBlades.sbSix.sb.selection=6

UltraProffieLite-L431CC.menu.tdeveloper.devOff=Off
UltraProffieLite-L431CC.menu.tdeveloper.devOff.devMode.selection=PF_DEVELOPER_MODE_OFF
UltraProffieLite-L431CC.menu.tdeveloper.devOn=On
UltraProffieLite-L431CC.menu.tdeveloper.devOn.devMode.selection=PF_DEVELOPER_MODE_ON

UltraProffieLite-L431CC.menu.zdiagnoseMode.statusOn=On
UltraProffieLite-L431CC.menu.zdiagnoseMode.statusOn.sp.selection=PF_STATUS_REPORT_ON
UltraProffieLite-L431CC.menu.zdiagnoseMode.statusOff=Off
UltraProffieLite-L431CC.menu.zdiagnoseMode.statusOff.sp.selection=PF_STATUS_REPORT_OFF

UltraProffieLite-L431CC.name=UltraProffieLite
UltraProffieLite-L431CC.vid.0=0x1209
UltraProffieLite-L431CC.pid.0=0x6668

UltraProffieLite-L431CC.upload.tool=stm32l4_serial
UltraProffieLite-L431CC.upload.protocol=uartSerial
UltraProffieLite-L431CC.upload.maximum_size=260096
UltraProffieLite-L431CC.upload.maximum_data_size=65536
UltraProffieLite-L431CC.upload.use_1200bps_touch=true
UltraProffieLite-L431CC.upload.wait_for_upload_port=false
UltraProffieLite-L431CC.upload.native_usb=false

UltraProffieLite-L431CC.build.mcu=cortex-m4
UltraProffieLite-L431CC.build.f_cpu=80000000L
UltraProffieLite-L431CC.build.board=STM32L4_PROFFIELITE
UltraProffieLite-L431CC.build.arch=STM32L4
UltraProffieLite-L431CC.build.core=stm32l4
UltraProffieLite-L431CC.build.vid=0x1209
UltraProffieLite-L431CC.build.pid=0x6668
UltraProffieLite-L431CC.build.did=0xffff
UltraProffieLite-L431CC.build.usb_manufacturer="hubbe.net"
UltraProffieLite-L431CC.build.usb_product="Proffieboard"
UltraProffieLite-L431CC.build.extra_flags=-DULTRA_PROFFIE -DHWVER='{bv.selection}' -D{os.selection} -D{devMode.selection} -D{sp.selection} -D{pp.selection} -DHW_NUM_BLADES={sb.selection} -DHW_NUM_BUTTONS=2 -DHW_PREFIX=L -DHW_LETTER1={bv.audio} -DHW_LETTER2={bv.charger} -DHW_LETTER3={bv.sns} -DHW_LETTER4={bv.pwmch} -DHW_LETTER5={bv.booster} -DSTM32L431xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant -felide-constructors -ffast-math {build.usb_flags} {build.dosfs_flags}
UltraProffieLite-L431CC.build.flags.optimize=-Os
UltraProffieLite-L431CC.build.flags.ldspecs=--specs=nano.specs -specs=nosys.specs
UltraProffieLite-L431CC.build.usb_type=USB_TYPE_NONE

UltraProffieLite-L431CC.build.ldscript=linker_scripts/STM32L431CC_FLASH.ld
UltraProffieLite-L431CC.build.openocdscript=openocd_scripts/stm32l431cc_proffielite.cfg
UltraProffieLite-L431CC.build.variant=STM32L431CC-ProffieLite
UltraProffieLite-L431CC.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l431 -larm_cortexM4lf_math
UltraProffieLite-L431CC.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 


##############################################################
# ST UltraProffieZero-L431CC
# ---------------------------------------
menu.boardVersion=Board Version
menu.operatingSys=Operating System
menu.prop=Prop
menu.SupportedBlades=Supported blades
menu.tdeveloper=Developer Mode
menu.zdiagnoseMode=Diagnose Mode


