RSX-Engineering/arduino-ultraproffie/boards.txt
UltraProffieZero-L431CC.build.dosfs_sdcard=0
UltraProffieZero-L431CC.build.dosfs_sflash=1

UltraProffieZero-L431CC.menu.boardVersion.HWVER1=PZ31L
UltraProffieZero-L431CC.menu.boardVersion.HWVER1.bv.selection=Z31L
UltraProffieZero-L431CC.menu.boardVersion.HWVER1.bv.audio=3
UltraProffieZero-L431CC.menu.boardVersion.HWVER1.bv.charger=1
UltraProffieZero-L431CC.menu.boardVersion.HWVER1.bv.sns=L
UltraProffieZero-L431CC.menu.boardVersion.HWVER1.bv.pwmch=2
UltraProffieZero-L431CC.menu.boardVersion.HWVER1.bv.booster=1

UltraProffieZero-L431CC.menu.boardVersion.HWVER2=PZ30L
UltraProffieZero-L431CC.menu.boardVersion.HWVER2.bv.selection=Z30L
UltraProffieZero-L431CC.menu.boardVersion.HWVER2.bv.audio=3
UltraProffieZero-L431CC.menu.boardVersion.HWVER2.bv.charger=0
UltraProffieZero-L431CC.menu.boardVersion.HWVER2.bv.sns=L
UltraProffieZero-L431CC.menu.boardVersion.HWVER2.bv.pwmch=2
UltraProffieZero-L431CC.menu.boardVersion.HWVER2.bv.booster=1

UltraProffieZero-L431CC.menu.boardVersion.HWVER3=PZ21L
UltraProffieZero-L431CC.menu.boardVersion.HWVER3.bv.selection=Z21L
UltraProffieZero-L431CC.menu.boardVersion.HWVER3.bv.audio=2
UltraProffieZero-L431CC.menu.boardVersion.HWVER3.bv.charger=1
UltraProffieZero-L431CC.menu.boardVersion.HWVER3.bv.sns=L
UltraProffieZero-L431CC.menu.boardVersion.HWVER3.bv.pwmch=2
UltraProffieZero-L431CC.menu.boardVersion.HWVER3.bv.booster=0

UltraProffieZero-L431CC.menu.boardVersion.HWVER4=PZ20L
UltraProffieZero-L431CC.menu.boardVersion.HWVER4.bv.selection=Z20L
UltraProffieZero-L431CC.menu.boardVersion.HWVER4.bv.audio=2
UltraProffieZero-L431CC.menu.boardVersion.HWVER4.bv.charger=0
UltraProffieZero-L431CC.menu.boardVersion.HWVER4.bv.sns=L
UltraProffieZero-L431CC.menu.boardVersion.HWVER4.bv.pwmch=2
UltraProffieZero-L431CC.menu.boardVersion.HWVER4.bv.booster=0

UltraProffieZero-L431CC.menu.operatingSys.pfosx=ProffieOSX
UltraProffieZero-L431CC.menu.operatingSys.pfosx.os.selection=OSx
UltraProffieZero-L431CC.menu.operatingSys.pfos=ProffieOS
UltraProffieZero-L431CC.menu.operatingSys.pfos.os.selection=OSx_None

UltraProffieZero-L431CC.menu.prop.prop1=UltraSaber
UltraProffieZero-L431CC.menu.prop.prop1.pp.selection=PF_PROP_ULTRASABERS
UltraProffieZero-L431CC.menu.prop.prop2=Saber
UltraProffieZero-L431CC.menu.prop.prop2.pp.selection=PF_PROP_SABER
UltraProffieZero-L431CC.menu.prop.prop3=Saber SHTOK
UltraProffieZero-L431CC.menu.prop.prop3.pp.selection=PF_PROP_SABER_SHTOK
UltraProffieZero-L431CC.menu.prop.prop4=Saber SA22C
UltraProffieZero-L431CC.menu.prop.prop4.pp.selection=PF_PROP_SABER_SA22C
UltraProffieZero-L431CC.menu.prop.prop5=Saber FETT
UltraProffieZero-L431CC.menu.prop.prop5.pp.selection=PF_PROP_SABER_FETT
UltraProffieZero-L431CC.menu.prop.prop6=Saber BC
UltraProffieZero-L431CC.menu.prop.prop6.pp.selection=PF_PROP_SABER_BC
UltraProffieZero-L431CC.menu.prop.prop7=Detonator
UltraProffieZero-L431CC.menu.prop.prop7.pp.selection=PF_PROP_DETON
UltraProffieZero-L431CC.menu.prop.prop8=Blaster
UltraProffieZero-L431CC.menu.prop.prop8.pp.selection=PF_PROP_BLASTER
UltraProffieZero-L431CC.menu.prop.prop9=AudioFx
UltraProffieZero-L431CC.menu.prop.prop9.pp.selection=PF_PROP_AUDIOFX

UltraProffieZero-L431CC.menu.SupportedBlades.sbdefTwo=2 (default)
UltraProffieZero-L431CC.menu.SupportedBlades.sbdefTwo.sb.selection=2
UltraProffieZero-L431CC.menu.SupportedBlades.sbOne=1
UltraProffieZero-L431CC.menu.SupportedBlades.sbOne.sb.selection=1
UltraProffieZero-L431CC.menu.SupportedBlades.sbTwo=2
UltraProffieZero-L431CC.menu.SupportedBlades.sbTwo.sb.selection=2
UltraProffieZero-L431CC.menu.SupportedBlades.sbThree=3
UltraProffieZero-L431CC.menu.SupportedBlades.sbThree.sb.selection=3

UltraProffieZero-L431CC.menu.tdeveloper.devOff=Off
UltraProffieZero-L431CC.menu.tdeveloper.devOff.devMode.selection=PF_DEVELOPER_MODE_OFF
UltraProffieZero-L431CC.menu.tdeveloper.devOn=On
UltraProffieZero-L431CC.menu.tdeveloper.devOn.devMode.selection=PF_DEVELOPER_MODE_ON

UltraProffieZero-L431CC.menu.zdiagnoseMode.statusOn=On
UltraProffieZero-L431CC.menu.zdiagnoseMode.statusOn.sp.selection=PF_STATUS_REPORT_ON
UltraProffieZero-L431CC.menu.zdiagnoseMode.statusOff=Off
UltraProffieZero-L431CC.menu.zdiagnoseMode.statusOff.sp.selection=PF_STATUS_REPORT_OFF

UltraProffieZero-L431CC.name=UltraProffieZero
UltraProffieZero-L431CC.vid.0=0x1209
UltraProffieZero-L431CC.pid.0=0x6668

UltraProffieZero-L431CC.upload.tool=stm32l4_serial
UltraProffieZero-L431CC.upload.protocol=uartSerial
UltraProffieZero-L431CC.upload.maximum_size=260096
UltraProffieZero-L431CC.upload.maximum_data_size=65536
UltraProffieZero-L431CC.upload.use_1200bps_touch=true
UltraProffieZero-L431CC.upload.wait_for_upload_port=false
UltraProffieZero-L431CC.upload.native_usb=false

UltraProffieZero-L431CC.build.mcu=cortex-m4
UltraProffieZero-L431CC.build.f_cpu=80000000L
UltraProffieZero-L431CC.build.board=STM32L4_PROFFIELITE
UltraProffieZero-L431CC.build.arch=STM32L4
UltraProffieZero-L431CC.build.core=stm32l4
UltraProffieZero-L431CC.build.vid=0x1209
UltraProffieZero-L431CC.build.pid=0x6668
UltraProffieZero-L431CC.build.did=0xffff
UltraProffieZero-L431CC.build.usb_manufacturer="hubbe.net"
UltraProffieZero-L431CC.build.usb_product="Proffieboard"
UltraProffieZero-L431CC.build.extra_flags=-DULTRA_PROFFIE -DHWVER='{bv.selection}' -D{os.selection} -D{devMode.selection} -D{sp.selection} -D{pp.selection} -DHW_NUM_BLADES={sb.selection} -DHW_NUM_BUTTONS=1 -DHW_PREFIX=Z -DHW_LETTER1={bv.audio} -DHW_LETTER2={bv.charger} -DHW_LETTER3={bv.sns} -DHW_LETTER4={bv.pwmch} -DHW_LETTER5={bv.booster} -DSTM32L431xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant -felide-constructors -ffast-math {build.usb_flags} {build.dosfs_flags}
UltraProffieZero-L431CC.build.flags.optimize=-Os
UltraProffieZero-L431CC.build.flags.ldspecs=--specs=nano.specs -specs=nosys.specs
UltraProffieZero-L431CC.build.usb_type=USB_TYPE_NONE

UltraProffieZero-L431CC.build.ldscript=linker_scripts/STM32L431CC_FLASH.ld
UltraProffieZero-L431CC.build.openocdscript=openocd_scripts/stm32l431cc_proffielite.cfg
UltraProffieZero-L431CC.build.variant=STM32L431CC-ProffieLite
UltraProffieZero-L431CC.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l431 -larm_cortexM4lf_math
UltraProffieZero-L431CC.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 
